In [1]:
import numpy as np
import pandas as pd

In [3]:
python_list = [1,2,3]
array = np.array(python_list)
dictionary = {'x' :1, 'y':2, 'z':3}
letters = ['x','y','z']

In [4]:
pd.Series(python_list)

0    1
1    2
2    3
dtype: int64

In [5]:
pd.Series(array)

0    1
1    2
2    3
dtype: int32

In [6]:
pd.Series(python_list, letters)

x    1
y    2
z    3
dtype: int64

In [7]:
pd.Series(array, letters)

x    1
y    2
z    3
dtype: int32

In [8]:
pd.Series(dictionary)

x    1
y    2
z    3
dtype: int64

In [9]:
ser = pd.Series(dictionary)
ser[0]

1

In [10]:
ser['x']

1

In [11]:
rand = np.random.randn(3,2) * 5

In [12]:
rand

array([[ 6.16298181,  8.4331699 ],
       [-2.68238048, -5.78911139],
       [-4.86761216,  2.02761446]])

In [13]:
ind = [1,2,3]
col =['a','b']

In [16]:
df = pd.DataFrame(rand, ind, col)

In [17]:
df

          a         b
1  6.162982  8.433170
2 -2.682380 -5.789111
3 -4.867612  2.027614

In [18]:
df['a']

1    6.162982
2   -2.682380
3   -4.867612
Name: a, dtype: float64

In [20]:
df[['a','b']]

          a         b
1  6.162982  8.433170
2 -2.682380 -5.789111
3 -4.867612  2.027614

In [21]:
df.loc[1]

a    6.162982
b    8.433170
Name: 1, dtype: float64

In [22]:
df.iloc[0]

a    6.162982
b    8.433170
Name: 1, dtype: float64

In [23]:
df.loc[1,'a']

6.162981807313712

In [24]:
df.loc[[2,3],'a']

2   -2.682380
3   -4.867612
Name: a, dtype: float64

In [25]:
df['c'] = np.random.randn(3)

In [26]:
df

          a         b         c
1  6.162982  8.433170  0.217946
2 -2.682380 -5.789111  0.262111
3 -4.867612  2.027614 -0.371149

In [27]:
df.drop('a',axis = 1)

          b         c
1  8.433170  0.217946
2 -5.789111  0.262111
3  2.027614 -0.371149

In [28]:
df>1

       a      b      c
1   True   True  False
2  False  False  False
3  False   True  False

In [29]:
df[df>1]

          a         b   c
1  6.162982  8.433170 NaN
2       NaN       NaN NaN
3       NaN  2.027614 NaN

In [30]:
df['b'] >2

1     True
2    False
3     True
Name: b, dtype: bool

In [31]:
df[df['b']>2]

          a         b         c
1  6.162982  8.433170  0.217946
3 -4.867612  2.027614 -0.371149

In [32]:
df[(df['b'] >2) & (df['c']>0)]

          a        b         c
1  6.162982  8.43317  0.217946